)	276798
(	276798
;	143235
VAR_1	106217
.	104890
}	96224
{	96224
METHOD_1	88843
public	63006
,	60564
VAR_2	57944
TYPE_1	54747
void	51727
METHOD_2	43495
=	32610
return	31615
VAR_3	30478
METHOD_3	25048
java.lang.String	21776
TYPE_2	19253
int	15464
this	15438
VAR_4	14604
new	14114
if	12484
null	11746
STRING_1	11627
METHOD_4	11528
>	9886
<	9876
private	9006
boolean	8065
static	6780
0	6546
throws	6301
TYPE_3	6205
true	6022
false	5914
VAR_5	5907
protected	5864
super	5813
]	5548
[	5548
+	5515
final	4814
METHOD_5	4346
==	4135
!=	3957
1	3954
STRING_2	3838
:	3780
android.view.View	3282
INT_1	2995
get	2927
i	2765
java.lang.Exception	2723
java.util.List	2686
value	2599
long	2576
id	2540
add	2447
name	2345
VAR_6	2306
-	2248
android.content.Intent	2236
java.lang.Object	2232
else	2200
double	2187
java.io.IOException	2047
view	2039
position	2031
context	1980
class	1915
?	1901
for	1843
!	1843
TYPE_4	1789
result	1768
java.lang.System.out.println	1734
event	1621
intent	1620
toString	1608
x	1563
key	1530
remove	1507
try	1463
size	1463
index	1453
float	1436
message	1377
setText	1363
data	1359
args	1358
catch	1346
METHOD_6	1345
start	1318
STRING_3	1230
java.lang.Integer	1197
y	1173
&&	1138
synchronized	1102
java.util.ArrayList	1061
item	1034
++	980
main	925
*	923
throw	914
type	910
equals	905
VAR_7	904
init	901
show	879
t	870
execute	864
length	850
update	849
put	843
case	837
c	814
java.io.File	774
error	774
response	738
byte	736
assertEquals	732
p	725
b	711
java.lang.Throwable	706
url	687
INT_2	681
/	680
state	679
set	674
path	669
getName	657
||	644
java.lang.Long	643
msg	636
+=	612
getActivity	607
android.content.Context	603
listener	600
text	590
getString	584
info	582
node	580
a	580
n	578
file	578
...	559
java.util.Map	548
contains	540
getId	527
getText	519
list	518
count	516
TYPE_5	516
delete	514
isEmpty	505
query	482
java.util.Date	481
status	479
getValue	479
java.lang.Boolean	473
java.lang.Class	463
STRING_4	460
>=	452
switch	431
build	424
java.util.Set	415
height	413
values	398
VAR_8	392
java.lang.Void	391
date	388
params	384
getContext	375
element	374
instanceof	373
setEnabled	372
while	370
format	370
title	367
FLOAT_1	363
append	360
time	359
METHOD_7	356
target	346
obj	344
break	338
<=	332
extends	331
java.lang.Double	318
out	316
str	303
java.lang.Thread	296
f	296
handle	294
assertTrue	293
java.util.Collection	291
source	287
java.lang.String.format	286
native	282
offset	278
end	277
--	274
commit	273
content	271
abstract	264
char	256
replace	251
setValue	248
string	241
number	238
output	224
compareTo	223
buffer	220
token	211
min	211
CHAR_1	209
field	207
%	203
STRING_5	198
java.lang.Integer.parseInt	196
INT_3	192
getClass	190
fileName	190
assert	190
java.util.Arrays.asList	188
VAR_9	187
java.util.HashMap	183
substring	181
j	180
default	179
line	175
java.lang.CharSequence	175
array	173
open	172
temp	171
num	169
assertThat	165
to	160
getData	159
filename	159
getTime	158
getInt	157
toLowerCase	156
TYPE_6	153
java.io.InputStream	152
getType	152
method	149
writer	145
-=	145
label	143
filePath	142
java.lang.System.exit	141
assertNotNull	141
sum	140
arg	140
"\n"	139
replaceAll	138
0.0	138
k	137
java.lang.StringBuilder	132
java.util.Random	127
startTime	126
fieldName	126
param	125
short	122
getView	122
setState	120
java.net.URL	119
&	117
getBoolean	116
finally	114
java.util.Calendar	110
iterator	110
trim	108
split	108
parameters	108
first	107
buf	105
|	104
java.lang.NullPointerException	103
VAR_10	102
METHOD_8	102
"0"	101
java.util.HashSet	99
java.lang.Float	99
step	97
java.lang.Integer.toString	97
className	97
STRING_6	97
java.lang.System.out.print	95
answer	95
1.0	94
java.lang.System.err.println	92
counter	86
1.0F	82
getIntent	81
getColor	81
0.0F	80
endTime	79
results	78
startsWith	76
fail	75
src	74
java.util.LinkedList	74
select	73
java.lang.Math.abs	73
java.util.Iterator	72
FLOAT_2	71
pattern	70
nodes	69
tmp	67
java.util.Properties	67
expr	66
java.util.Scanner	63
java.awt.Color	62
var	61
intValue	61
INT_4	61
"true"	61
"name"	59
attribute	58
keys	57
1L	56
java.util.Calendar.getInstance	55
rows	54
java.lang.Math.round	54
getConfig	54
"id"	54
java.lang.ClassNotFoundException	53
errors	53
toUpperCase	52
java.util.Collections.sort	52
CHAR_2	52
VAR_11	51
String	51
STRING_7	51
0L	51
function	50
TYPE_7	50
operation	47
java.util.Map.Entry	45
java.lang.Math.random	45
android.widget.Button	44
*=	43
names	42
java.lang.StringBuffer	38
STRING_8	36
op	35
java.lang.Math.pow	35
diff	35
words	33
java.lang.Long.parseLong	31
out.write	30
VAR_12	30
java.util.Vector	29
getSelection	28
^	28
METHOD_9	28
|=	27
java.io.FileOutputStream	27
java.io.BufferedReader	26
INT_5	26
"false"	22
java.io.FileWriter	21
java.io.FileInputStream	21
STRING_9	21
org.testng.Assert.assertEquals	20
~	19
not	18
java.io.BufferedWriter	18
FLOAT_3	18
java.util.regex.Matcher	17
addComponent	17
CHAR_3	17
"type"	17
VAR_13	16
"\t"	16
writer.write	15
do	15
&=	15
args.length	14
TYPE_8	14
STRING_10	14
NULL	14
stringBuilder.append	13
java.awt.Font	12
java.io.FileReader	11
continue	11
^=	10
CHAR_4	10
VAR_14	9
<<=	9
java.util.logging.Logger.getLogger	8
android.widget.LinearLayout	8
METHOD_10	8
INT_6	8
/=	8
VAR_15	7
TYPE_9	7
STRING_11	7
%=	5
VAR_16	4
TYPE_10	4
field.type	2
VAR_17	2
TYPE_11	2
STRING_12	2
INT_7	2
CHAR_5	2
>>>=	2
TYPE_14	1
TYPE_13	1
TYPE_12	1
INT_9	1
INT_8	1
FLOAT_6	1
FLOAT_5	1
FLOAT_4	1
CHAR_7	1
CHAR_6	1
>>=	1
"unchecked"	1
