)	371714
(	371714
;	192520
.	150311
VAR_1	135084
}	110341
{	110341
METHOD_1	91832
VAR_2	81219
,	78932
TYPE_1	64770
public	63198
METHOD_2	63100
void	51338
=	46561
VAR_3	44121
METHOD_3	36479
return	35865
TYPE_2	25814
java.lang.String	23738
if	23593
VAR_4	21191
this	20591
STRING_1	20537
null	19152
new	18631
METHOD_4	17021
int	16544
>	11841
<	11745
boolean	9013
0	9010
private	9004
+	8939
VAR_5	8799
false	8693
true	8543
TYPE_3	8448
!=	7932
==	7318
static	6929
STRING_2	6729
throws	6642
]	6390
[	6390
METHOD_5	6284
super	6031
protected	5908
final	5683
:	5624
1	5144
INT_1	5006
else	4105
!	3878
i	3611
get	3565
VAR_6	3455
android.view.View	3335
java.lang.System.out.println	3307
-	3187
java.lang.Exception	3158
java.util.List	2943
?	2940
value	2918
id	2825
add	2789
long	2762
try	2742
&&	2693
class	2631
android.content.Intent	2617
name	2551
catch	2490
TYPE_4	2478
double	2466
position	2389
context	2357
java.lang.Object	2329
view	2300
for	2277
java.io.IOException	2252
result	2250
size	2078
intent	2037
toString	2016
METHOD_6	1969
STRING_3	1943
setText	1844
remove	1797
event	1763
x	1719
index	1684
key	1679
throw	1639
synchronized	1638
float	1564
message	1549
start	1525
equals	1522
data	1493
java.lang.Integer	1427
args	1426
java.util.ArrayList	1395
||	1355
VAR_7	1319
show	1292
y	1283
length	1250
*	1233
++	1194
item	1186
case	1152
type	1089
put	1047
error	1033
t	1021
INT_2	1016
info	995
init	992
c	985
update	953
main	940
isEmpty	931
execute	931
p	922
getName	912
getActivity	903
/	902
assertEquals	879
java.io.File	877
response	872
set	854
b	830
state	829
getString	794
java.lang.Throwable	789
+=	789
byte	786
>=	784
getId	780
path	770
contains	748
url	741
java.lang.Long	739
STRING_4	730
listener	723
TYPE_5	715
getText	695
text	684
a	681
n	680
msg	680
node	672
file	672
count	657
setEnabled	652
android.content.Context	633
java.util.Map	627
list	608
java.util.Date	603
instanceof	602
FLOAT_1	600
status	599
getValue	595
...	594
java.lang.Boolean	560
VAR_8	556
delete	551
break	545
query	544
METHOD_7	536
switch	520
height	515
java.lang.Class	512
getContext	489
build	487
<=	484
date	479
values	471
append	464
while	459
java.util.Set	455
java.lang.Thread	447
format	440
time	431
params	423
java.lang.Double	422
title	419
element	414
out	412
java.lang.String.format	409
java.lang.Void	401
replace	398
target	394
obj	383
extends	382
assertTrue	353
f	351
source	334
--	334
str	333
toLowerCase	323
offset	318
setValue	317
content	312
STRING_5	312
CHAR_1	312
java.util.Collection	311
end	308
handle	303
commit	294
finally	278
INT_3	278
char	273
getClass	272
output	269
trim	268
buffer	268
min	265
assert	259
number	255
string	249
token	248
compareTo	248
%	248
VAR_9	244
java.util.HashMap	240
default	240
temp	239
field	230
replaceAll	225
fileName	223
substring	222
java.lang.Integer.parseInt	218
getTime	218
abstract	218
&	215
j	210
getType	204
0.0	201
java.util.Arrays.asList	200
java.lang.NullPointerException	200
TYPE_6	200
open	199
line	198
assertThat	196
array	195
|	194
getData	190
java.lang.CharSequence	189
-=	188
num	187
"\n"	186
to	185
assertNotNull	185
getBoolean	179
filename	178
getInt	175
filePath	172
getView	170
method	169
java.lang.StringBuilder	169
java.lang.System.exit	166
STRING_6	165
writer	163
java.io.InputStream	162
k	161
label	158
arg	158
sum	153
short	153
startTime	152
setState	149
java.util.Random	147
java.util.HashSet	147
java.lang.System.out.print	145
java.lang.System.err.println	145
param	144
VAR_10	141
split	138
iterator	138
getIntent	137
METHOD_8	137
answer	135
java.lang.Math.abs	132
java.lang.Integer.toString	131
parameters	129
first	129
java.net.URL	126
fieldName	126
buf	125
fail	124
startsWith	123
native	123
toUpperCase	122
"0"	122
1.0	120
0.0F	118
className	116
java.util.Calendar	115
java.util.LinkedList	113
java.lang.Float	113
step	110
getColor	108
tmp	107
counter	105
1.0F	103
results	98
INT_4	96
FLOAT_2	94
select	91
CHAR_2	90
STRING_7	88
java.util.Scanner	86
intValue	84
VAR_11	84
java.util.Collections.sort	83
expr	80
0L	80
src	79
java.util.Properties	78
pattern	77
endTime	75
java.lang.Math.round	73
java.util.Iterator	72
nodes	68
errors	68
"true"	67
getConfig	65
"id"	65
java.awt.Color	64
1L	64
var	63
java.util.Calendar.getInstance	63
attribute	63
TYPE_7	63
keys	62
java.lang.ClassNotFoundException	62
android.widget.Button	62
STRING_8	62
function	58
rows	57
operation	57
"name"	57
*=	53
java.util.Map.Entry	50
names	49
java.lang.Math.pow	47
VAR_12	47
String	47
diff	42
java.util.Vector	41
java.lang.Math.random	41
out.write	40
java.lang.Long.parseLong	40
op	39
STRING_9	38
"false"	37
|=	36
org.testng.Assert.assertEquals	36
java.io.BufferedReader	35
METHOD_9	35
INT_5	35
^	34
words	33
java.io.FileOutputStream	33
getSelection	31
java.lang.StringBuffer	30
stringBuilder.append	29
java.util.logging.Logger.getLogger	29
java.util.regex.Matcher	26
java.io.FileWriter	25
java.io.FileInputStream	25
FLOAT_3	25
args.length	24
~	23
java.io.BufferedWriter	23
addComponent	22
CHAR_3	22
VAR_13	21
"type"	21
not	20
java.awt.Font	20
android.widget.LinearLayout	20
TYPE_8	20
STRING_10	20
NULL	20
writer.write	19
&=	19
continue	17
do	16
"\t"	15
CHAR_4	13
VAR_14	12
STRING_11	12
TYPE_9	11
INT_6	11
/=	11
java.io.FileReader	10
^=	10
METHOD_10	10
<<=	10
VAR_15	8
%=	7
FLOAT_4	6
VAR_16	5
INT_7	5
TYPE_10	4
STRING_12	4
INT_8	4
CHAR_5	4
>>=	4
VAR_17	3
field.type	2
VAR_18	2
TYPE_11	2
FLOAT_6	2
FLOAT_5	2
>>>=	2
VAR_19	1
TYPE_14	1
TYPE_13	1
TYPE_12	1
METHOD_11	1
INT_9	1
INT_10	1
FLOAT_7	1
CHAR_7	1
CHAR_6	1
"unchecked"	1
